# XMLSAXEndDoc

## Description
Write XML using SAX, end of a document. XMLSAXBeginDocFile begins a document.

```pascal
FUNCTION XMLSAXEndDoc(XMLHandle : LONGINT) : INTEGER;
```

```python

def vs.XMLSAXEndDoc(XMLHandle):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|XMLHandle|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* XML SAX